"use strict";

module.exports = {
  up: async (queryInterface) => {
    await queryInterface.sequelize.query(`
      DELETE FROM Sentences
      WHERE localeId = "yue" AND sentence IN (
        "其實閪係越屌越緊嘅 鬆咗係代表條女老咗啫",
        "其實阿瑩已經做好咗同阿勝生bb嘅心理準備 但阿勝就係到家下都冇畀個名份佢",
        "大波瑤好易潮吹 俾我插兩嘢就噴到成床都係",
        "大波瑩個籮柚唔小心掂到後面個阿勝 搞到佢碌鳩當堂硬咗",
        "我真係唔知原來有鳩骨嘅喎",
        "搞咗半粒鐘 阿勝終於用盡全力 將呢一個月嘅量全部射晒入大波瑩嘅子宮度",
        "當阿成隻手指插入佢個閪嗰剎那 一種又痛但係又好想要嘅感覺充滿佢全身",
        "閪俾人屌得多就梗係臭㗎喇",
        "阿勝啲精從阿瑩個閪度慢慢咁流咗出嚟 阿瑩知道 阿勝就係專登唔戴套同佢扑嘢",
        "阿勝抽插咗一陣 大波瑩個閪流咗好多白色嘅泡沫狀液體出嚟",
        "阿勝越插越勁 瑩女就快嗌到沙聲 下體就嚟要噴嘢出嚟咁"
      )
    `);
  },
  down: () => Promise.resolve(),
};
